yueming95/micinveter/Document/ReferenceMaterial/基于 GaN 的 1.6kW 双向微型逆变器参考设计/Example Projects/F28003X/uinv.syscfg
adc3.$name                       = "ADC_C";
adc3.adcBase                     = "ADCC_BASE";
adc3.soc0IndependentNameMode     = true;
adc3.soc0InputCapacitance        = 300;
adc3.soc0InputResistance         = 300;
adc3.soc0UseCalculatedSampleTime = true;
adc3.soc1IndependentNameMode     = true;
adc3.soc1InputCapacitance        = 300;
adc3.soc1InputResistance         = 300;
adc3.soc1UseCalculatedSampleTime = true;
adc3.soc2IndependentNameMode     = true;
adc3.soc2InputCapacitance        = 300;
adc3.soc2InputResistance         = 300;
adc3.soc2UseCalculatedSampleTime = true;
adc3.soc3IndependentNameMode     = true;
adc3.soc3InputCapacitance        = 300;
adc3.soc3InputResistance         = 300;
adc3.soc3UseCalculatedSampleTime = true;
adc3.soc4IndependentNameMode     = true;
adc3.soc4InputResistance         = 10000;
adc3.soc4InputCapacitance        = 100000;
adc3.enableInterrupt1            = true;
adc3.soc5IndependentNameMode     = true;
adc3.soc5SampleWindow            = 100;
adc3.interrupt1SOCSource         = "ADC_SOC_NUMBER5";
adc3.soc0Trigger                 = "ADC_TRIGGER_EPWM8_SOCA";
adc3.soc0SampleWindow            = 12;
adc3.soc1SampleWindow            = 12;
adc3.soc2SampleWindow            = 12;
adc3.soc1Trigger                 = "ADC_TRIGGER_EPWM8_SOCA";
adc3.soc2Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc3.soc3Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc3.soc3SampleWindow            = 12;
adc3.soc4Trigger                 = "ADC_TRIGGER_EPWM8_SOCA";
adc3.soc4SampleWindow            = 12;
adc3.soc5Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc3.enabledSOCs                 = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5","ADC_SOC_NUMBER6"];
adc3.soc6Name                    = "SOC_TEMP";
adc3.soc6IndependentNameMode     = true;
adc3.soc6Channel                 = "ADC_CH_ADCIN1";
adc3.soc6SampleWindow            = 12;
adc3.interrupt2SOCSource         = "ADC_SOC_NUMBER4";
adc3.enableInterrupt2            = true;
adc3.interruptPulseMode          = "ADC_PULSE_END_OF_CONV";
adc3.soc0Channel                 = "ADC_CH_ADCIN5";
adc3.soc1Channel                 = "ADC_CH_ADCIN3";
adc3.soc2Channel                 = "ADC_CH_ADCIN5";
adc3.soc3Channel                 = "ADC_CH_ADCIN3";
adc3.soc0Name                    = "SOC_DC_BUS_CS1";
adc3.soc1Name                    = "SOC_AC_CS1";
adc3.soc2Name                    = "SOC_DC_BUS_CS2";
adc3.soc3Name                    = "SOC_AC_CS2";
adc3.soc4Name                    = "SOC_AC_VS";
adc3.soc5Name                    = "SOC_DC_BUS_VS";
adc3.enabledInts                 = ["ADC_INT_NUMBER1"];
adc3.registerInterrupts          = ["1"];
adc3.adcClockPrescaler           = "ADC_CLK_DIV_2_0";
adc3.soc5Channel                 = "ADC_CH_ADCIN11";
adc3.soc4Channel                 = "ADC_CH_ADCIN7";
adc3.adcInt1.enableInterrupt     = true;
adc3.adcInt1.interruptHandler    = "ISR1";

asysctl.enableTemperatureSensor = true;
asysctl.analogReference         = "INTERNAL";
asysctl.analogReferenceVoltage  = "1P65";

clb1.$name     = "myCLB0";
clb1.enableCLB = true;

cmpss1.cmpssBase           = "CMPSS4_BASE";
cmpss1.enableModule        = true;
cmpss1.asysCMPHPMXSELValue = "1";
cmpss1.asysCMPLPMXSELValue = "1";
cmpss1.lowCompInvert       = true;
cmpss1.dacValHigh          = 3500;
cmpss1.dacValLow           = 500;
cmpss1.$name               = "myCMPSS";

cmpss2.$name               = "CMPSS_SR";
cmpss2.cmpssBase           = "CMPSS2_BASE";
cmpss2.asysCMPHPMXSELValue = "2";
cmpss2.asysCMPLPMXSELValue = "2";
cmpss2.enableModule        = true;
cmpss2.enableBlanking      = true;
cmpss2.configBlanking      = "7";
cmpss2.configLatchLow      = true;
cmpss2.configLatchHigh     = true;
cmpss2.latchResetHigh      = true;
cmpss2.latchResetLow       = true;
cmpss2.lowCompInvert       = true;
cmpss2.initFilterHigh      = true;
cmpss2.initFilterLow       = true;
cmpss2.lowCTRIP            = "CMPSS_TRIP_FILTER";
cmpss2.highCTRIP           = "CMPSS_TRIP_FILTER";
cmpss2.dacValHigh          = 2000;
cmpss2.dacValLow           = 2096;
cmpss2.sampleWindowLow     = 7;
cmpss2.thresholdLow        = 5;
cmpss2.sampleWindowHigh    = 7;
cmpss2.thresholdHigh       = 5;

cmpss1.analog            = analog1;
analog1.$name            = "myANALOGPinMux0";
adc1.analog              = analog1;
adc3.analog              = analog1;
adc2.analog              = analog1;
analog1.useCase          = "CUSTOM";
cmpss2.analog            = analog1;
analog1.useInterfacePins = ["A0/B15/C15/DACA_OUT","A1/B7/DACB_OUT","A10/B1/C10","A12, C5","A2/B6/C9","A3, C7/B9","A4/B8","A5","A6","A9","B0/C11","B11","B2/C6","B3/VDAC","B4/C8","B5","C1","C2/B12","C3/A7"];

ecap1.$name                  = "myECAP0";
ecap1.interruptSourceCapture = ["ECAP_ISR_SOURCE_CAPTURE_EVENT_4"];
ecap1.eventStop              = "ECAP_EVENT_4";
ecap1.resetCounters          = true;
ecap1.eventOnePolarity       = "ECAP_EVNT_FALLING_EDGE";
ecap1.eventThreePolarity     = "ECAP_EVNT_FALLING_EDGE";
ecap1.counterResetOnEvent    = ["ECAP_EVENT_4"];
ecap1.enableLoadCounter      = true;
ecap1.captureMode            = "ECAP_ONE_SHOT_CAPTURE_MODE";
ecap1.ecapInput              = "ECAP_INPUT_INPUTXBAR1";

epwm1.$name                                                      = "BOOST1";
epwm1.epwmDeadband_enableFED                                     = true;
epwm1.epwmDeadband_enableRED                                     = true;
epwm1.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmDeadband_inputFED                                      = "EPWM_DB_INPUT_EPWMB";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                      = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                      = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "6";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar          = "6";
epwm1.epwmDeadband_delayRED                                      = 2;
epwm1.epwmDeadband_delayFED                                      = 2;
epwm1.epwmTimebase_phaseEnable                                   = true;
epwm1.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm1.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.epwmTimebase_phaseShift                                    = 2;
epwm1.epwmTimebase_period                                        = 250;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm1.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM8";
epwm1.epwm.epwm_aPin.$assign                                     = "GPIO6";
epwm1.epwm.epwm_bPin.$assign                                     = "GPIO7";

epwm2.$name                                                      = "BOOST2";
epwm2.epwmDeadband_enableFED                                     = true;
epwm2.epwmDeadband_enableRED                                     = true;
epwm2.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmDeadband_inputFED                                      = "EPWM_DB_INPUT_EPWMB";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                      = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                      = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm2.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar          = "6";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "6";
epwm2.epwmDeadband_delayRED                                      = 2;
epwm2.epwmDeadband_delayFED                                      = 2;
epwm2.epwmTimebase_phaseEnable                                   = true;
epwm2.epwmTimebase_period                                        = 250;
epwm2.epwmTimebase_phaseShift                                    = 2;
epwm2.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm2.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm2.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm2.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM8";
epwm2.epwm.$assign                                               = "EPWM2";
epwm2.epwm.epwm_aPin.$assign                                     = "GPIO2";
epwm2.epwm.epwm_bPin.$assign                                     = "GPIO3";

