yueming95/micinveter/Document/ReferenceMaterial/基于 GaN 的 1.6kW 双向微型逆变器参考设计/Example Projects/F28003X/uinv.syscfg
epwm8.$name                                                      = "DCAC";
epwm8.copyUse                                                    = true;
epwm8.copyFrom                                                   = "LLC2";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm8.epwmDeadband_enableRED                                     = true;
epwm8.epwmDeadband_enableFED                                     = true;
epwm8.epwmTimebase_period                                        = 500;
epwm8.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm8.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm8.epwmDeadband_delayRED                                      = 10;
epwm8.epwmDeadband_delayFED                                      = 10;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "6";
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar          = "6";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                      = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                      = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable    = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitEnable    = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitValue     = "3";
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitForce     = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitForce     = true;
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitValue     = "2";
epwm8.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm8.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm8.epwm.$assign                                               = "EPWM8";
epwm8.epwm.epwm_aPin.$assign                                     = "GPIO14";
epwm8.epwm.epwm_bPin.$assign                                     = "GPIO15";

epwmxbar1.$name      = "myEPWMXBAR0";
epwmxbar1.muxesUsed  = ["XBAR_MUX06"];
epwmxbar1.tripInput  = "XBAR_TRIP5";
epwmxbar1.mux6Config = "XBAR_EPWM_MUX06_CMPSS4_CTRIPH_OR_L";

epwmxbar2.$name           = "myEPWMXBAR1_SRTRIP_P";
epwmxbar2.tripInput       = "XBAR_TRIP11";
epwmxbar2.useSourceSelect = true;
epwmxbar2.sourceSignals   = ["CMPSS2_CTRIPL"];

epwmxbar3.useSourceSelect = true;
epwmxbar3.$name           = "myEPWMXBAR1_SRTRIP_N";
epwmxbar3.tripInput       = "XBAR_TRIP12";
epwmxbar3.sourceSignals   = ["CMPSS2_CTRIPH"];

gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.$name             = "ISO_PWR_EN";
gpio1.gpioPin.$assign   = "GPIO59";

gpio2.$name             = "LED1";
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.writeInitialValue = true;
gpio2.gpioPin.$assign   = "GPIO19, X1";

gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.$name             = "uINV_DCAC_Relay";
gpio3.gpioPin.$assign   = "GPIO44";

gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.$name           = "uINV_DCAC_Top_LF";
gpio4.gpioPin.$assign = "GPIO56";

gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.$name           = "uINV_DCAC_Bottom_LF";
gpio5.gpioPin.$assign = "GPIO57";

gpio6.$name             = "ENABLE";
gpio6.direction         = "GPIO_DIR_MODE_OUT";
gpio6.writeInitialValue = true;
gpio6.initialValue      = 1;
gpio6.gpioPin.$assign   = "GPIO34";

gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.$name             = "uINV_DCAC_TestPoint_1";
gpio7.gpioPin.$assign   = "GPIO17";

gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.$name             = "uINV_DCAC_TestPoint_2";
gpio8.gpioPin.$assign   = "GPIO16";

gpio9.writeInitialValue = true;
gpio9.$name             = "Shutdown_Demo";
gpio9.gpioPin.$assign   = "GPIO31";

gpio10.writeInitialValue = true;
gpio10.$name             = "RapidShutdown";
gpio10.gpioPin.$assign   = "GPIO30";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
inputxbar_input1.inputxbarGpio = "GPIO60";

inputxbar_input2.$name          = "myINPUTXBARINPUT1";
inputxbar_input2.inputxbarInput = "XBAR_INPUT2";
inputxbar_input2.inputxbarGpio  = "GPIO58";

inputxbar_input3.$name          = "myINPUTXBARINPUT2";
inputxbar_input3.inputxbarInput = "XBAR_INPUT3";
inputxbar_input3.inputxbarGpio  = "GPIO48";

inputxbar_input4.$name          = "myINPUTXBARINPUT3";
inputxbar_input4.inputxbarInput = "XBAR_INPUT4";
inputxbar_input4.inputxbarGpio  = "GPIO49";

sci1.$name                 = "SCI_COMMS";
sci1.useInterrupts         = false;
sci1.sci.$assign           = "SCIA";
sci1.sci.sci_rxPin.$assign = "GPIO28";
sci1.sci.sci_txPin.$assign = "GPIO29";

sync.ADCSOCAOutputSelect = ["SYSCTL_ADCSOC_SRC_PWM1SOCA","SYSCTL_ADCSOC_SRC_PWM2SOCA","SYSCTL_ADCSOC_SRC_PWM3SOCA","SYSCTL_ADCSOC_SRC_PWM4SOCA","SYSCTL_ADCSOC_SRC_PWM8SOCA"];
sync.ADCSOCBOutputSelect = ["SYSCTL_ADCSOC_SRC_PWM1SOCB","SYSCTL_ADCSOC_SRC_PWM2SOCB","SYSCTL_ADCSOC_SRC_PWM3SOCB","SYSCTL_ADCSOC_SRC_PWM4SOCB","SYSCTL_ADCSOC_SRC_PWM8SOCB"];

CMD.activateCMD = true;

CMD1.$name                                      = "CMD0";
CMD1.sectionMemory_stack                        = ["RAMM1"];
CMD1.sectionMemory_ramfunc                      = ["FLASH_BANK0_SEC1"];
CMD1.sectionAlignEnable_ramfunc                 = true;
CMD1.sectionRunFromDifferentAddr_ramfunc        = true;
CMD1.sectionAlignEnable_text                    = true;
CMD1.sectionMemory_cinit                        = ["FLASH_BANK0_SEC1"];
CMD1.sectionAlignEnable_cinit                   = true;
CMD1.sectionMemory_switch                       = ["FLASH_BANK0_SEC1"];
CMD1.sectionAlignEnable_switch                  = true;
CMD1.sectionMemory_init_array                   = ["FLASH_BANK0_SEC1"];
CMD1.sectionAlignEnable_init_array              = true;
CMD1.sectionMemory_const                        = ["FLASH_BANK0_SEC4"];
CMD1.sectionAlignEnable_const                   = true;
CMD1.sectionMemory_sysmem                       = ["RAMLS5"];
CMD1.sectionMemory_ovly                         = ["FLASH_BANK0_SEC1"];
CMD1.sectionAlignEnable_ovly                    = true;
CMD1.sectionMemory_binit                        = ["FLASH_BANK0_SEC0"];
CMD1.sectionAlignEnable_binit                   = true;
CMD1.sectionMemory_codestart                    = "0x080000";
CMD1.sectionMemory_text                         = ["FLASH_BANK0_SEC2","FLASH_BANK0_SEC3","FLASH_BANK0_SEC4","FLASH_BANK0_SEC5","FLASH_BANK0_SEC6","FLASH_BANK0_SEC7","FLASH_BANK0_SEC8","FLASH_BANK0_SEC9"];
CMD1.sectionMemory_data                         = ["RAMLS5","RAMLS6","RAMLS7"];
CMD1.sectionMemory_bss                          = ["RAMLS1","RAMLS2","RAMLS3","RAMLS4","RAMLS5","RAMLS6"];
CMD1.sectionRun_ramfunc                         = ["RAMGS3"];
CMD1.userSection.create(2);
CMD1.userSection[0].$name                       = "FPUmathTables";
CMD1.userSection[0].sectionName                 = "FPUmathTables";
CMD1.userSection[0].sectionMemory               = ["FLASH_BANK0_SEC6"];
CMD1.userSection[0].sectionRunFromDifferentAddr = true;
CMD1.userSection[0].sectionRun                  = ["RAMGS1"];
CMD1.userSection[0].sectionAlignEnable          = true;
CMD1.userSection[1].$name                       = "dclfuncs";
CMD1.userSection[1].sectionName                 = "dclfuncs";
CMD1.userSection[1].sectionMemory               = ["FLASH_BANK0_SEC7"];
CMD1.userSection[1].sectionRunFromDifferentAddr = true;
CMD1.userSection[1].sectionAlignEnable          = true;
CMD1.userSection[1].sectionRun                  = ["RAMGS2"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                           = "ANALOG";
analog1.analog["a0/b15/c15/daca_outPin"].$suggestSolution = "A0/B15/C15/DACA_OUT";
analog1.analog["a1/b7/dacb_outPin"].$suggestSolution      = "A1/B7/DACB_OUT";
analog1.analog["a10/b1/c10Pin"].$suggestSolution          = "A10/B1/C10";
analog1.analog["a12, c5Pin"].$suggestSolution             = "A12, C5";
analog1.analog["a2/b6/c9Pin"].$suggestSolution            = "A2/B6/C9";
analog1.analog["a3, c7/b9Pin"].$suggestSolution           = "A3, C7/B9";
analog1.analog["a4/b8Pin"].$suggestSolution               = "A4/B8";
analog1.analog.a5Pin.$suggestSolution                     = "A5";
analog1.analog.a6Pin.$suggestSolution                     = "A6";
analog1.analog.a9Pin.$suggestSolution                     = "A9";
analog1.analog["b0/c11Pin"].$suggestSolution              = "B0/C11";
analog1.analog.b11Pin.$suggestSolution                    = "B11";
analog1.analog["b2/c6Pin"].$suggestSolution               = "B2/C6";
analog1.analog["b3/vdacPin"].$suggestSolution             = "B3/VDAC";
analog1.analog["b4/c8Pin"].$suggestSolution               = "B4/C8";
analog1.analog.b5Pin.$suggestSolution                     = "B5";
analog1.analog.c1Pin.$suggestSolution                     = "C1";
analog1.analog["c2/b12Pin"].$suggestSolution              = "C2/B12";
analog1.analog["c3/a7Pin"].$suggestSolution               = "C3/A7";
epwm1.epwm.$suggestSolution                               = "EPWM4";
